Repository: weblate/cartero
Catalog: po/*.po
Languages: cs, pt_br

source: Make HTTP requests and test APIs
cs: Spouštějte HTTP volání a testujte API
pt_br: Fazer solicitações HTTP e testar APIs

source: Cartero is a graphical HTTP client that can be used as a developer tool to test web APIs and perform all kind of HTTP requests to web servers. It is compatible with any REST, SOAP or XML-RPC API and it supports multiple request methods as well as attaching body payloads to compatible requests.
cs: Cartero je grafický HTTP klient, který můžete použít jako developerský nástroj pro testování webových API a volání všech druhů HTTP požadavků na webových serverech. Je kompatibilní s jakýmkoliv REST, SOAP nebo XML-RPC API a podporuje množství metod volání, stejně tak i připojení těla požadavku k podporovanému volání.
pt_br: Cartero é um cliente HTTP gráfico que pode ser usado como uma ferramenta de desenvolvedor para testar APIs da Web e executar todo tipo de solicitações HTTP para servidores da Web. É compatível com qualquer API REST, SOAP ou XML-RPC e suporta vários métodos de solicitação, além de anexar cargas úteis corporais a solicitações compatíveis.

source: Features:
cs: Funkce:
pt_br: Característicos:

source: Loads and saves to plain Git-friendly TOML files, so that you can own your data.
cs: Načítá a ukládá do čistých TOML souborů kompatibilních se systémem Git, takže sami vlastníte svá data.
pt_br: Carrega e salva para arquivos TOML simples e amigáveis, para que você possa possuir seus dados.

source: Customization and modification of the request headers and body payloads.
pt_br: Personalização e modificação dos cabeçalhos de solicitação e cargas úteis do corpo.

source: Variable binding for API keys and other secret information.
pt_br: Volificação variável para chaves da API e outras informações secretas.

source: Main window of Cartero
cs: Hlavní okno aplikace Cartero
pt_br: Janela principal de Cartero

source: Modifying HTTP headers
cs: Úprava HTTP hlaviček
pt_br: Modificando cabeçalhos HTTP

source: Setting the request payload
pt_br: Definindo a carga útil da solicitação

source: Cartero
pt_br: Carteiro

source: Gnome;GTK;HTTP;REST;
pt_br: Gnome; gtk; http; descanso;

source: Automatically indent new lines for the request body
cs: Automaticky odsazovat nové řádky v těle požadavku
pt_br: Recomete novas linhas automaticamente para o corpo de solicitação

source: Wrap the body content
cs: Zalamovat obsah těla
pt_br: Enrole o conteúdo do corpo

source: Whether to indent the request body with spaces or tabs
cs: Zda se má tělo požadavku odsadit mezerami nebo tabulátory
pt_br: Se deve recuperar o corpo de solicitação com espaços ou guias

source: Show line numbers in the request and response bodies
cs: Zobrazit čísla řádků v požadavku a těle odpovědi
pt_br: Mostrar números de linha nos órgãos de solicitação e resposta

source: How many characters to pad when indenting the request body
cs: Kolik použít znaků při odsazení těla požadavku
pt_br: Quantos personagens preencherem ao recuar o corpo do pedido

source: How large should new windows be
cs: Jak má být široké nové okno
pt_br: Quão grande deve ser as novas janelas

source: How tall should new windows be
cs: Jak má být vysoké nové okno
pt_br: Qual a altura das novas janelas

source: Whether the application should open maximized
cs: Zda má být aplikace otevřena maximalizovaně
pt_br: Se o aplicativo deve abrir maximizado

source: The position of the split between two windows
cs: Pozice rozdělení dvou oken
pt_br: A posição da divisão entre duas janelas

source: The current list of opened files
cs: Aktuální seznam otevřených souborů
pt_br: A lista atual de arquivos abertos

source: The last location where a file was opened
cs: Umístění posledně otevřeného souboru
pt_br: O último local onde um arquivo foi aberto

source: The last location where a file was saved
cs: Umístění posledně uloženého souboru
pt_br: O último local onde um arquivo foi salvo

source: Whether to validate the TLS certificates during a request
cs: Zda mají být během požadavku ověřovány TLS certifikáty
pt_br: Se deve validar os certificados TLS durante uma solicitação

source: Whether to follow redirections if that is the server response
cs: Zda mají být následována přesměrování, pokud jsou obsažena v odpovědi serveru
pt_br: Se deve seguir os redirecionamentos, se essa é a resposta do servidor

source: Maximum number of redirections to follow before giving up
cs: Maximální počet následovaných přesměrování
pt_br: Número máximo de redirecimentos a seguir antes de desistir

source: Maximum timeout when awaiting for an HTTP response.
cs: Časový limit čekání na HTTP odpověď.
pt_br: Tempo limite máximo ao aguardar uma resposta HTTP.

source: Whether to use light or dark mode.
cs: Zda použít světlý nebo tmavý režim.
pt_br: Se deve usar o modo claro ou escuro.

source: The custom font in use
cs: Používané vlastní písmo
pt_br: A fonte personalizada em uso

source: Whether to use the system font or a custom one
cs: Zda použít systémové nebo vlastní písmo
pt_br: Se deve usar a fonte do sistema ou personalizada

source: Whether to create backup files on save
cs: Zda při ukládání vytvářet zálohy souborů
pt_br: Se deve criar arquivos de backup em salvar

# shortcuts window
source: General shortcuts
cs: Obecné klávesové zkratky
pt_br: Atalhos gerais

# shortcuts window
source: Show Keyboard Shortcuts
cs: Zobrazit klávesové zkratky
pt_br: Mostre atalhos de teclado

# shortcuts window
source: Quit
cs: Zavřít
pt_br: Desistir

# shortcuts window
source: Tab operations
cs: Operace s panely
pt_br: Operações de guia

# shortcuts window
source: New request tab
cs: Nový panel požadavku
pt_br: Guia Novo solicitação

# shortcuts window
source: Open request
cs: Otevřít požadavek
pt_br: Solicitação aberta

# shortcuts window
source: Save request
cs: Uložit požadavek
pt_br: Salvar solicitação

# shortcuts window
source: Save request as
cs: Uložit požadavek jako
pt_br: Salvar solicitação como

# shortcuts window
source: Close request tab
cs: Zavřít panel požadavku
pt_br: Guia de solicitação de fechamento

# shortcuts window
source: Request operations
cs: Operace s požadavky
pt_br: Solicitar operações

# shortcuts window
source: Send request
cs: Odeslat požadavek
pt_br: Enviar solicitação

source: Copy
cs: Kopírovat
pt_br: Cópia

source: Request URL
cs: URL požadavku
pt_br: Solicitar url

source: Send
cs: Odeslat
pt_br: Enviar

source: Execute this HTTP request
cs: Provést tento HTTP požadavek
pt_br: Execute esta solicitação HTTP

source: Parameters
cs: Parametry
pt_br: Parâmetros

source: Headers
cs: Hlavičky
pt_br: Cabeçalhos

source: Variables
cs: Proměnné
pt_br: Variáveis

source: Body
cs: Tělo
pt_br: Corpo

source: Export request
cs: Exportovat požadavek
pt_br: Solicitação de exportação

source: Export to
cs: Exportovat do
pt_br: Exportar para

source: (none)
cs: (nic)
pt_br: (nenhum)

source: Name
cs: Jméno
pt_br: Nome

source: Value
cs: Hodnota
pt_br: Valor

source: Actions
cs: Akce
pt_br: Ações

source: Toggle secret
cs: Skrýt
pt_br: Alternar o segredo

source: Delete
cs: Smazat
pt_br: Excluir

source: New
cs: Nový
pt_br: Novo

source: Open
cs: Otevřít
pt_br: Abrir

source: Save
cs: Uložit
pt_br: Salvar

source: Welcome to Cartero
cs: Vítá vás aplikace Cartero
pt_br: Bem -vindo a um Mailman

source: Create or open a request and start testing APIs now.
cs: Vytvořte nebo otevřete požadavek a začněte testovat API.
pt_br: Crie ou abra uma solicitação e comece a testar as APIs agora.

source: New tab
cs: Nový panel
pt_br: Nova guia

source: Open request…
cs: Otevřít požadavek…
pt_br: Pedido aberto…

source: Save request
cs: Uložit požadavek
pt_br: Salvar solicitação

source: Save request as…
cs: Uložit požadavek jako…
pt_br: Salvar solicitação como…

source: Close tab
cs: Zavřít panel
pt_br: Beche a guia

source: Settings
cs: Nastavení
pt_br: Configurações

source: Body appearance
cs: Vzhled těla
pt_br: Aparência corporal

source: Wrap content
cs: Zalomit obsah
pt_br: Enrole o conteúdo

source: Show line numbers
cs: Zobrazit čísla řádků
pt_br: Mostrar números de linha

source: Automatic indentation
cs: Automatické odsazení
pt_br: Recuo automático

source: Indent with spaces
cs: Odsadit mezerami
pt_br: Recuo com espaços

source: Indent with tabs
cs: Odsadit tabulátory
pt_br: Recuo com guias

source: Spaces per tab
cs: Délka tabulátoru v mezerách
pt_br: Espaços por guia

source: Keyboard shortcuts
cs: Klávesové zkratky
pt_br: Atalhos de teclado

source: About Cartero
cs: O aplikaci Cartero
pt_br: Sobre Cartero

source: Quit
cs: Ukončit
pt_br: Desistir

source: Request method
cs: Metoda požadavku
pt_br: Método de solicitação

source: Body type
cs: Typ těla
pt_br: Tipo de corpo

source: URL Encoded
pt_br: URL codificado

source: Multipart Form Data
pt_br: Dados de formulário multipart

source: Raw
pt_br: Cru

source: Ready to request
cs: Připraveno na požadavek
pt_br: Pronto para solicitar

source: Use the Send button to send a network request and it will show here.
cs: Použijte tlačítko Odeslat k vykonání síťového požadavku, výsledek bude zobrazen zde.
pt_br: Use o botão Enviar para enviar uma solicitação de rede e ele será exibido aqui.

source: Save changes?
cs: Uložit změny?
pt_br: Salvar mudanças?

source: There are changes that have not been saved yet. What do you want to do?
cs: Máte neuložené změny. Co chcete udělat?
pt_br: Existem mudanças que ainda não foram salvas. O que você quer fazer?

source: _Cancel
cs: _Zrušit
pt_br: _Cancelar

source: _Discard
cs: Zahodi_t změny
pt_br: _Descartar

source: _Save
cs: _Uložit
pt_br: _Salvar

source: Search
cs: Hledat
pt_br: Procurar

source: Previous result
cs: Předchozí výsledek
pt_br: Resultado anterior

source: Next result
cs: Další výsledek
pt_br: Próximo resultado

source: Close search
cs: Zavřít hledání
pt_br: Pesquisa próxima

source: Application
cs: Aplikace
pt_br: Aplicativo

source: Appearance
cs: Vzhled
pt_br: Aparência

source: Application style
cs: Styl vzhledu
pt_br: Estilo de aplicativo

source: Follow system settings
cs: Podle systému
pt_br: Siga as configurações do sistema

source: Light mode
cs: Světlé téma
pt_br: Modo Claro

source: Dark mode
cs: Tmavé téma
pt_br: Modo escuro

source: Use system font
cs: Použít systémové písmo
pt_br: Use a fonte do sistema

source: Custom font
cs: Vlastní písmo
pt_br: Fonte personalizada

source: File settings
cs: Volby souborů
pt_br: Configurações de arquivo

source: Create backup files
cs: Vytvářet záložní soubory
pt_br: Crie arquivos de backup

source: You might not want to enable this if you are already using a version control such as Git
cs: Tuto volbu možná nebudete chtít povolit, pokud již používáte správu verzí, jako je Git
pt_br: Você pode não querer ativar isso se já estiver usando um controle de versão como Git

source: HTTP Client
cs: HTTP klient
pt_br: Cliente http

source: Enforce TLS validation
cs: Vynutit ověření TLS
pt_br: Aplicar a validação do TLS

source: Follow redirects
cs: Následovat přesměrování
pt_br: Siga os redirecionamentos

source: Maximum redirects
cs: Maximální počet přesměrování
pt_br: Redirecionamentos máximos

source: Request timeout
cs: Časový limit požadavku
pt_br: Solicitar tempo limite

source: Content copied to the clipboard
cs: Obsah zkopírován do schránky
pt_br: Conteúdo copiado para a área de transferência

source: Request (.cartero)
cs: Požadavek (.cartero)
pt_br: Solicitação (.Cartero)

source: Request
cs: Požadavek
pt_br: Solicitar

source: Open request
cs: Otevřít požadavek
pt_br: Solicitação aberta

source: (untitled)
cs: (bez názvu)
pt_br: (sem título)

source: Draft
cs: Koncept
pt_br: Rascunho

source: {} of {}
cs: {} z {}
pt_br: {} de {}

source: {} result
cs: {} požadavek
pt_br: {} resultado

source: The Cartero authors
cs: Autoři aplikace Cartero
pt_br: Os autores de Cartero

source: © 2024 the Cartero authors
cs: © 2024 autoři aplikace Cartero
pt_br: © 2024 Os autores Cartero
